In [1]:
import pandas as pd

In [2]:
data = [[1, 100], [2, 200], [3, 300]]
employee = pd.DataFrame(data, columns=['Id', 'Salary']).astype({'Id':'Int64', 'Salary':'Int64'})

In [3]:
employee

   Id  Salary
0   1     100
1   2     200
2   3     300

In [16]:
employee['rank'] = employee['Salary'].rank(method='dense', ascending=False)
employee

   Id  Salary  rank
0   1     100   3.0
1   2     200   2.0
2   3     300   1.0

In [27]:
n=2
salary_series = employee[employee['rank'] == n]['Salary']
salary_series

1    200
Name: Salary, dtype: Int64

In [36]:
pd.DataFrame([None if len(salary_series) == 0 else salary_series.iloc[0]], columns=['getNthHighestSalary'])

   getNthHighestSalary(n)
0                     200

In [37]:
pd.DataFrame({f'getNthHighestSalary({n})' : [None if len(salary_series) == 0 else salary_series.iloc[0]]})

   getNthHighestSalary(2)
0                     200